Белгипрозем_2017/src/Documents/ИзменениеДатДоговоров/ИзменениеДатДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеДатДоговоров</name>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДатыДоговора</name>
    <type>
      <types>CatalogRef.мВидыДатДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановыйСрок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Documents/ИзменениеДатДоговоров/ManagerModule.bsl
// Инициализирует таблицу значений, содержащие данные документа.
//
Функция ИнициализироватьДанныеДокумента(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Установил", Пользователи.ТекущийПользователь());
	Запрос.Текст ="ВЫБРАТЬ
	              |	ИзменениеДатДоговоровЭтапы.ЭтапДоговора,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.Ссылка КАК Основание,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.Корреспондент,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.Договор,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.ВидДатыДоговора,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.ДатаУстановления КАК Дата,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.Дата КАК Период,
	              |	&Установил КАК Установил,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.Комментарий
	              |ИЗ
	              |	Документ.ИзменениеДатДоговоров.Этапы КАК ИзменениеДатДоговоровЭтапы
	              |ГДЕ
	              |	ИзменениеДатДоговоровЭтапы.Ссылка = &Ссылка";
    Результат = Запрос.Выполнить().Выгрузить();
  
	Возврат Результат;
	
КонецФункции // ИнициализироватьДанныеДокумента()
